# SQL en Python
<img src=".\img\image-4.png" alt="EDA Path"
    title="A typical EDA path" width="600" height="300" />
## Conectamos con la base de datos

### Documentación de la librería SQLite3 que vamos a utilizar:
https://docs.python.org/3/library/sqlite3.html

In [53]:
# Importamos librerias
import pandas as pd
import sqlite3

In [54]:
# Conectamos con la base de datos chinook.db
path = "chinook.db"
connection = sqlite3.connect(path)
# Obtenemos un cursor que utilizaremos para hacer las queries
curs = connection.cursor()

In [3]:
# Creamos una Query sencilla
query = """
SELECT *   
FROM genres
"""

In [4]:
my_query = curs.execute(query)
my_query

In [5]:
my_query.fetchall()

[(1, 'Rock'),
 (2, 'Jazz'),
 (3, 'Metal'),
 (4, 'Alternative & Punk'),
 (5, 'Rock And Roll'),
 (6, 'Blues'),
 (7, 'Latin'),
 (8, 'Reggae'),
 (9, 'Pop'),
 (10, 'Soundtrack'),
 (11, 'Bossa Nova'),
 (12, 'Easy Listening'),
 (13, 'Heavy Metal'),
 (14, 'R&B/Soul'),
 (15, 'Electronica/Dance'),
 (16, 'World'),
 (17, 'Hip Hop/Rap'),
 (18, 'Science Fiction'),
 (19, 'TV Shows'),
 (20, 'Sci Fi & Fantasy'),
 (21, 'Drama'),
 (22, 'Comedy'),
 (23, 'Alternative'),
 (24, 'Classical'),
 (25, 'Opera')]

In [6]:
# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas

def sql_query(query):

    curs.execute(query)
    datos_query = curs.fetchall()
    col_names = [description[0] for description in curs.description]
    return pd.DataFrame(datos_query, columns= col_names)

In [7]:
sql_query(query)

    GenreId                Name
0         1                Rock
1         2                Jazz
2         3               Metal
3         4  Alternative & Punk
4         5       Rock And Roll
5         6               Blues
6         7               Latin
7         8              Reggae
8         9                 Pop
9        10          Soundtrack
10       11          Bossa Nova
11       12      Easy Listening
12       13         Heavy Metal
13       14            R&B/Soul
14       15   Electronica/Dance
15       16               World
16       17         Hip Hop/Rap
17       18     Science Fiction
18       19            TV Shows
19       20    Sci Fi & Fantasy
20       21               Drama
21       22              Comedy
22       23         Alternative
23       24           Classical
24       25               Opera

In [8]:
# Tambien podemos obtener el mismo resultado directamente con pandas

## Ya podemos comenzar con la práctica de chinook:
Antes de empezar a atacar una base de datos, tendremos que saber qué hay dentro, y para ello lo mejor es ver cómo es su **modelo de datos**

![imagen](./img/chinook_data_model.png)

### 1.	Facturas de Clientes de Brasil, Nombre del cliente, Id de factura, fecha de la factura y el país de la factura

In [9]:
query= """
SELECT *
FROM customers, invoices
WHERE customers.customerId = invoices.CustomerId
"""

### 2.	Facturas de Clientes de Brasil

In [10]:

query= """
SELECT *
FROM customers c, invoices i
WHERE c.customerId = i.Customerid
"""
pd.read_sql_query(query, connection)

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,...,SupportRepId,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98
1,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96
2,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94
3,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99
4,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
407,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,45,59,2009-07-08 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,5.94
408,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,97,59,2010-02-26 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,1.99
409,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,218,59,2011-08-20 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,1.98
410,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,229,59,2011-09-30 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,13.86
411,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,284,59,2012-05-30 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,8.91

In [11]:
query = """
SELECT c.Firstname||" "||c.Lastname as "Full name", i.invoiceid, i.invoicedate, c.country
FROM CUSTOMERS c
JOIN invoices i on c.customerid = i.customerid
WHERE c.country = "Brazil"
"""
pd.read_sql_query(query, connection)

          Full name  InvoiceId          InvoiceDate Country
0    Luís Gonçalves         98  2010-03-11 00:00:00  Brazil
1    Luís Gonçalves        121  2010-06-13 00:00:00  Brazil
2    Luís Gonçalves        143  2010-09-15 00:00:00  Brazil
3    Luís Gonçalves        195  2011-05-06 00:00:00  Brazil
4    Luís Gonçalves        316  2012-10-27 00:00:00  Brazil
5    Luís Gonçalves        327  2012-12-07 00:00:00  Brazil
6    Luís Gonçalves        382  2013-08-07 00:00:00  Brazil
7   Eduardo Martins         25  2009-04-09 00:00:00  Brazil
8   Eduardo Martins        154  2010-11-14 00:00:00  Brazil
9   Eduardo Martins        177  2011-02-16 00:00:00  Brazil
10  Eduardo Martins        199  2011-05-21 00:00:00  Brazil
11  Eduardo Martins        251  2012-01-09 00:00:00  Brazil
12  Eduardo Martins        372  2013-07-02 00:00:00  Brazil
13  Eduardo Martins        383  2013-08-12 00:00:00  Brazil
14  Alexandre Rocha         57  2009-09-06 00:00:00  Brazil
15  Alexandre Rocha         68  2009-10-17 00:00:00  Brazil
16  Alexandre Rocha        123  2010-06-17 00:00:00  Brazil
17  Alexandre Rocha        252  2012-01-22 00:00:00  Brazil
18  Alexandre Rocha        275  2012-04-25 00:00:00  Brazil
19  Alexandre Rocha        297  2012-07-28 00:00:00  Brazil
20  Alexandre Rocha        349  2013-03-18 00:00:00  Brazil
21  Roberto Almeida         34  2009-05-23 00:00:00  Brazil
22  Roberto Almeida        155  2010-11-14 00:00:00  Brazil
23  Roberto Almeida        166  2010-12-25 00:00:00  Brazil
24  Roberto Almeida        221  2011-08-25 00:00:00  Brazil
25  Roberto Almeida        350  2013-03-31 00:00:00  Brazil
26  Roberto Almeida        373  2013-07-03 00:00:00  Brazil
27  Roberto Almeida        395  2013-10-05 00:00:00  Brazil
28   Fernanda Ramos         35  2009-06-05 00:00:00  Brazil
29   Fernanda Ramos         58  2009-09-07 00:00:00  Brazil
30   Fernanda Ramos         80  2009-12-10 00:00:00  Brazil
31   Fernanda Ramos        132  2010-07-31 00:00:00  Brazil
32   Fernanda Ramos        253  2012-01-22 00:00:00  Brazil
33   Fernanda Ramos        264  2012-03-03 00:00:00  Brazil
34   Fernanda Ramos        319  2012-11-01 00:00:00  Brazil

### 3.	Muestra cada factura asociada a cada agente de ventas con su nombre completo.

In [12]:
query = """
SELECT i.*, e.firstname||" "||e.lastname as "full name"
FROM employees e
JOIN customers c ON e.employeeid = c.supportrepid
JOIN invoices i ON i.customerid = c.customerid
"""
pd.read_sql_query(query, connection)

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total,full name
0,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98,Jane Peacock
1,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96,Jane Peacock
2,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94,Jane Peacock
3,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99,Jane Peacock
4,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98,Jane Peacock
...,...,...,...,...,...,...,...,...,...,...
407,88,57,2010-01-13 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,17.91,Steve Johnson
408,217,57,2011-08-20 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,1.98,Steve Johnson
409,240,57,2011-11-22 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,3.96,Steve Johnson
410,262,57,2012-02-24 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,5.94,Steve Johnson
411,314,57,2012-10-14 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,0.99,Steve Johnson

### 4.	Para cada factura muestra el nombre del cliente, el país, el nombre del agente y el total

In [13]:
query = """
SELECT i.*, c.firstname||" "||c.Lastname as "Full name", c.country, e.Firstname||" "||e.lastname as "Agent name"
FROM employees e
JOIN customers c on e.employeeid = c.supportrepid
JOIN invoices i on i.customerid = c.customerid
"""
pd.read_sql_query(query, connection)

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total,Full name,Country,Agent name
0,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98,Luís Gonçalves,Brazil,Jane Peacock
1,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96,Luís Gonçalves,Brazil,Jane Peacock
2,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94,Luís Gonçalves,Brazil,Jane Peacock
3,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99,Luís Gonçalves,Brazil,Jane Peacock
4,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98,Luís Gonçalves,Brazil,Jane Peacock
...,...,...,...,...,...,...,...,...,...,...,...,...
407,45,59,2009-07-08 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,5.94,Puja Srivastava,India,Jane Peacock
408,97,59,2010-02-26 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,1.99,Puja Srivastava,India,Jane Peacock
409,218,59,2011-08-20 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,1.98,Puja Srivastava,India,Jane Peacock
410,229,59,2011-09-30 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,13.86,Puja Srivastava,India,Jane Peacock
411,284,59,2012-05-30 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,8.91,Puja Srivastava,India,Jane Peacock

### 5.	Muestra cada artículo de la factura con el nombre de la canción.

In [14]:
query = """
SELECT tr.name, t.quantity
FROM invoices i
JOIN invoice_items t ON t.invoiceid = i.invoiceid
JOIN tracks tr ON tr.trackid = t.trackid
"""
pd.read_sql_query(query, connection)

                               Name  Quantity
0               Experiment In Terra         1
1                 Take the Celestra         1
2                 Shout It Out Loud         1
3                  Calling Dr. Love         1
4                          Strutter         1
...                             ...       ...
2235           Esporrei Na Manivela         1
2236  No Fundo Do Quintal Da Escola         1
2237                 Que Luz É Essa         1
2238          The Power Of Equality         1
2239   Mellowship Slinky In B Major         1

[2240 rows x 2 columns]

### 6.	Muestra todas las canciones con su nombre, formato, álbum y género.

In [15]:
query = """
SELECT tr.name as "song", g.name as "genre", a.title as "album", m.name as "format"
FROM albums a
JOIN tracks tr ON tr.albumid = a.albumid
JOIN genres g ON g.genreid = tr.genreid
JOIN media_types m ON m.mediatypeid = tr.mediatypeid
"""
pd.read_sql(query, connection)

,song,genre,album,format
0,For Those About To Rock (We Salute You),Rock,For Those About To Rock We Salute You,MPEG audio file
1,Balls to the Wall,Rock,Balls to the Wall,Protected AAC audio file
2,Fast As a Shark,Rock,Restless and Wild,Protected AAC audio file
3,Restless and Wild,Rock,Restless and Wild,Protected AAC audio file
4,Princess of the Dawn,Rock,Restless and Wild,Protected AAC audio file
...,...,...,...,...
3498,Pini Di Roma (Pinien Von Rom) \ I Pini Della V...,Classical,Respighi:Pines of Rome,Protected AAC audio file
3499,"String Quartet No. 12 in C Minor, D. 703 ""Quar...",Classical,Schubert: The Late String Quartets & String Qu...,Protected AAC audio file
3500,"L'orfeo, Act 3, Sinfonia (Orchestra)",Classical,Monteverdi: L'Orfeo,Protected AAC audio file
3501,"Quintet for Horn, Violin, 2 Violas, and Cello ...",Classical,Mozart: Chamber Music,Protected AAC audio file
3502,"Die Zauberflöte, K.620: ""Der Hölle Rache Kocht...",Opera,Mozart Gala: Famous Arias,Protected AAC audio file

### 7.	Muestra cuántas canciones hay en cada playlist y el nombre de cada playlist.

In [24]:
query= """
SELECT p.name as "playlist", COUNT(*)
FROM tracks t
JOIN playlist_track pt on pt.trackid = t.trackid
JOIN playlists p on p.playlistid = pt.playlistid
GROUP BY pt.playlistid
"""

pd.read_sql_query(query, connection)

                      playlist  COUNT(*)
0                        Music      3290
1                     TV Shows       213
2                   90’s Music      1477
3                        Music      3290
4                 Music Videos         1
5                     TV Shows       213
6              Brazilian Music        39
7                    Classical        75
8    Classical 101 - Deep Cuts        25
9   Classical 101 - Next Steps        25
10  Classical 101 - The Basics        25
11                      Grunge        15
12         Heavy Metal Classic        26
13                 On-The-Go 1         1

### 8.	Muestra cuánto ha vendido cada empleado.

In [31]:
query= """
SELECT e.firstname||" "||e.lastname as "employee",  SUM(it.quantity) AS "Songs sold"
FROM employees e
JOIN customers c ON c.supportrepid = e.employeeid
JOIN invoices i ON i.customerid = c.Customerid
JOIN invoice_items it ON it.invoiceid = i.invoiceid
GROUP BY e.employeeid
"""
pd.read_sql(query, connection)

        employee  Songs sold
0   Jane Peacock         796
1  Margaret Park         760
2  Steve Johnson         684

### 9.	¿Quién ha sido el agente de ventas que más ha vendido en 2009?

In [35]:
query = """
SELECT e.firstname||" "||e.lastname as "employee", SUM(total) as "sales"
FROM employees e
JOIN customers c ON e.employeeid = c.supportrepid
JOIN invoices i ON C.customerid = i.customerid
WHERE i.invoicedate LIKE "2009%"
GROUP BY employeeid
ORDER BY sales DESC
LIMIT 1
"""
pd.read_sql_query(query, connection)

        employee   sales
0  Steve Johnson  164.34

### 10.	¿Cuáles son los 3 grupos que más han vendido?

In [ ]:
query = """
SELECT
FROM invoice_items i
JOIN tracks t ON t.trackid = i.trackid
GROUP BY t.composer

### 11. Muestra cuántas canciones de Rock hay en cada playlist

In [45]:
query = """
SELECT p.name as "playlist name", COUNT(tr.name)
FROM playlists p
JOIN playlist_track pt ON pt.playlistid = p.playlistid
JOIN tracks tr ON tr.trackid = pt.trackid
JOIN genres g ON G.genreid = tr.genreid
WHERE g.name = "Rock"
GROUP BY p.playlistid
"""
pd.read_sql_query(query, connection)

         playlist name  COUNT(tr.name)
0                Music            1297
1           90’s Music             621
2                Music            1297
3               Grunge              14
4  Heavy Metal Classic               9

### 12. Muestra una tabla con todas canciones y su(s) Id de factura, hayan sido vendidas alguna vez o no.

In [52]:
query= """
SELECT t.name as "song", ii.invoiceid as "Fact.Num"
FROM tracks t
LEFT JOIN invoice_items ii ON ii.trackid = t.trackid
"""
pd.read_sql(query, connection)

                                                   song  Fact.Num
0               For Those About To Rock (We Salute You)     108.0
1                                     Balls to the Wall       1.0
2                                     Balls to the Wall     214.0
3                                       Fast As a Shark     319.0
4                                     Restless and Wild       1.0
...                                                 ...       ...
3754  String Quartet No. 12 in C Minor, D. 703 "Quar...     108.0
3755  String Quartet No. 12 in C Minor, D. 703 "Quar...     319.0
3756               L'orfeo, Act 3, Sinfonia (Orchestra)       NaN
3757  Quintet for Horn, Violin, 2 Violas, and Cello ...       NaN
3758                                      Koyaanisqatsi       NaN

[3759 rows x 2 columns]

### 13. ¿Cuántos artistas no tienen ningún album?

In [88]:
query="""
SELECT COUNT(*) as "artists without album"
FROM artists a
LEFT JOIN albums ar on ar.artistid = a.artistid
WHERE Title IS NULL
"""
pd.read_sql_query(query,connection)

   artists without album
0                     71